{
  "backend/main.mo": "Empty Motoko actor with no logic implemented.",
  "feature_evidence.json": "Evidence report listing two deployment-related features and the frontend files involved.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files for reference in build planning.",
  "frontend/deployment/production-domain.txt": "Specifies the valid production domain string 'for-my-yellow'.",
  "frontend/index.css": "Defines global Tailwind layers and OKLCH color variables for light and dark modes.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root app with an error boundary wrapping ProposalLayout and ProposalPage.",
  "frontend/src/components/BackgroundMusicControls.tsx": "Music control widget managing audio playback, volume, mute, and UI popover.",
  "frontend/src/components/CuteRingAnimation.tsx": "Animated ring image component with sparkle effects and safe asset loading.",
  "frontend/src/components/HeartConfetti.tsx": "Generates and animates 50 falling heart confetti pieces on celebration.",
  "frontend/src/components/LoveLetterEnvelopeView.tsx": "Envelope view component that displays an interactive 'tap to open' animation.",
  "frontend/src/components/PlayfulNoButton.tsx": "A 'No' button that jumps to random positions and cycles playful messages.",
  "frontend/src/components/ProposalLayout.tsx": "Page layout with hearts background, content container, music controls, and footer.",
  "frontend/src/config/proposalCopy.ts": "Contains customizable proposal text, acceptance messages, and rotating 'No' button messages.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor via React Query, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity auth context, handling login, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file exporting nothing because no backend queries are needed.",
  "frontend/src/index.css": "Defines global styles, Tailwind layers, color variables, custom animations, and romantic themed UI effects.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/ProposalPage.tsx": "Renders the proposal flow with asking, envelope reveal, and acceptance states using animations and themed components.",
  "frontend/src/utils/assetUrl.ts": "Generates correct asset URLs respecting the deployment base path.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, animations, and plugins for the project's styling system.",
  "project_state.json": "Tracks project requirements, existing features, deployment issues, and overall proposal site planning state."
}